PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16lf1566.inc
;----- AAD1TX0 Bits -----------------------------------------------------
TX10             EQU  H'0000'
TX11             EQU  H'0001'
TX12             EQU  H'0002'
TX13             EQU  H'0003'
TX14             EQU  H'0004'
TX15             EQU  H'0005'
TX16             EQU  H'0006'
TX17             EQU  H'0007'


;----- AD1TX0 Bits -----------------------------------------------------
TX10             EQU  H'0000'
TX11             EQU  H'0001'
TX12             EQU  H'0002'
TX13             EQU  H'0003'
TX14             EQU  H'0004'
TX15             EQU  H'0005'
TX16             EQU  H'0006'
TX17             EQU  H'0007'


;----- AAD1TX1 Bits -----------------------------------------------------
TX18             EQU  H'0000'
TX19             EQU  H'0001'


;----- AD1TX1 Bits -----------------------------------------------------
TX18             EQU  H'0000'
TX19             EQU  H'0001'


;----- AAD2TX0 Bits -----------------------------------------------------
TX20             EQU  H'0000'
TX21             EQU  H'0001'
TX22             EQU  H'0002'
TX23             EQU  H'0003'
TX24             EQU  H'0004'
TX25             EQU  H'0005'
TX26             EQU  H'0006'
TX27             EQU  H'0007'


;----- AD2TX0 Bits -----------------------------------------------------
TX20             EQU  H'0000'
TX21             EQU  H'0001'
TX22             EQU  H'0002'
TX23             EQU  H'0003'
TX24             EQU  H'0004'
TX25             EQU  H'0005'
TX26             EQU  H'0006'
TX27             EQU  H'0007'


;----- AAD2TX1 Bits -----------------------------------------------------
TX28             EQU  H'0000'
TX29             EQU  H'0001'
TX40             EQU  H'0002'


;----- AD2TX1 Bits -----------------------------------------------------
TX28             EQU  H'0000'
TX29             EQU  H'0001'
TX40             EQU  H'0002'


;----- AAD1CON0 Bits -----------------------------------------------------
ADON             EQU  H'0000'
GO_AAD1CON0      EQU  H'0001'

AD1ON            EQU  H'0000'
GO_NOT_DONE      EQU  H'0001'
CHS0             EQU  H'0002'
CHS1             EQU  H'0003'
CHS2             EQU  H'0004'
CHS3             EQU  H'0005'
CHS4             EQU  H'0006'
CHS5             EQU  H'0007'

GO_NOT_DONE1     EQU  H'0001'


;----- AADCON0 Bits -----------------------------------------------------
ADON             EQU  H'0000'
GO_AADCON0       EQU  H'0001'

AD1ON            EQU  H'0000'
GO_NOT_DONE      EQU  H'0001'
CHS0             EQU  H'0002'
CHS1             EQU  H'0003'
CHS2             EQU  H'0004'
CHS3             EQU  H'0005'
CHS4             EQU  H'0006'
CHS5             EQU  H'0007'

GO_NOT_DONE1     EQU  H'0001'


;----- AD1CON0 Bits -----------------------------------------------------
ADON             EQU  H'0000'
GO_AD1CON0       EQU  H'0001'

AD1ON            EQU  H'0000'
GO_NOT_DONE      EQU  H'0001'
CHS0             EQU  H'0002'
CHS1             EQU  H'0003'
CHS2             EQU  H'0004'
CHS3             EQU  H'0005'
CHS4             EQU  H'0006'
CHS5             EQU  H'0007'

GO_NOT_DONE1     EQU  H'0001'


;----- AADCON1 Bits -----------------------------------------------------
GO_NOT_DONE_ALL  EQU  H'0002'
ADNREF           EQU  H'0003'
ADFM             EQU  H'0007'

ADPREF0          EQU  H'0000'
ADPREF1          EQU  H'0001'
GO_ALL           EQU  H'0002'
ADCS0            EQU  H'0004'
ADCS1            EQU  H'0005'
ADCS2            EQU  H'0006'


;----- ADCOMCON Bits -----------------------------------------------------
GO_NOT_DONE_ALL  EQU  H'0002'
ADNREF           EQU  H'0003'
ADFM             EQU  H'0007'

ADPREF0          EQU  H'0000'
ADPREF1          EQU  H'0001'
GO_ALL           EQU  H'0002'
ADCS0            EQU  H'0004'
ADCS1            EQU  H'0005'
ADCS2            EQU  H'0006'


;----- AAD1CON2 Bits -----------------------------------------------------
TRIGSEL0         EQU  H'0004'
TRIGSEL1         EQU  H'0005'
TRIGSEL2         EQU  H'0006'


;----- AADCON2 Bits -----------------------------------------------------
TRIGSEL0         EQU  H'0004'
TRIGSEL1         EQU  H'0005'
TRIGSEL2         EQU  H'0006'


;----- AD1CON2 Bits -----------------------------------------------------
TRIGSEL0         EQU  H'0004'
TRIGSEL1         EQU  H'0005'
TRIGSEL2         EQU  H'0006'


;----- AAD1CON3 Bits -----------------------------------------------------
AD1DSEN          EQU  H'0000'
AD1IPEN          EQU  H'0001'
AD1IPPOL         EQU  H'0006'
AD1EPPOL         EQU  H'0007'

ADDSEN           EQU  H'0000'
ADIPEN           EQU  H'0001'
ADIPPOL          EQU  H'0006'
ADEPPOL          EQU  H'0007'


;----- AADCON3 Bits -----------------------------------------------------
AD1DSEN          EQU  H'0000'
AD1IPEN          EQU  H'0001'
AD1IPPOL         EQU  H'0006'
AD1EPPOL         EQU  H'0007'

ADDSEN           EQU  H'0000'
ADIPEN           EQU  H'0001'
ADIPPOL          EQU  H'0006'
ADEPPOL          EQU  H'0007'


;----- AD1CON3 Bits -----------------------------------------------------
AD1DSEN          EQU  H'0000'
AD1IPEN          EQU  H'0001'
AD1IPPOL         EQU  H'0006'
AD1EPPOL         EQU  H'0007'

ADDSEN           EQU  H'0000'
ADIPEN           EQU  H'0001'
ADIPPOL          EQU  H'0006'
ADEPPOL          EQU  H'0007'


;----- AADSTAT Bits -----------------------------------------------------
AD1CONV          EQU  H'0002'
AD2CONV          EQU  H'0006'

ADCONV           EQU  H'0002'

AD1STG0          EQU  H'0000'
AD1STG1          EQU  H'0001'
AD2STG0          EQU  H'0004'
AD2STG1          EQU  H'0005'


;----- ADSTAT Bits -----------------------------------------------------
AD1CONV          EQU  H'0002'
AD2CONV          EQU  H'0006'

ADCONV           EQU  H'0002'

AD1STG0          EQU  H'0000'
AD1STG1          EQU  H'0001'
AD2STG0          EQU  H'0004'
AD2STG1          EQU  H'0005'


;----- AAD1PRE Bits -----------------------------------------------------
ADPRE0           EQU  H'0000'
ADPRE1           EQU  H'0001'
ADPRE2           EQU  H'0002'
ADPRE3           EQU  H'0003'
ADPRE4           EQU  H'0004'
ADPRE5           EQU  H'0005'
ADPRE6           EQU  H'0006'


;----- AADPRE Bits -----------------------------------------------------
ADPRE0           EQU  H'0000'
ADPRE1           EQU  H'0001'
ADPRE2           EQU  H'0002'
ADPRE3           EQU  H'0003'
ADPRE4           EQU  H'0004'
ADPRE5           EQU  H'0005'
ADPRE6           EQU  H'0006'


